DATA EXPLORATIONS AND LOADING

In [1160]:
#importing dependencies

import pandas as pd

#mysql toolkit

import pymysql #this will work as an adapter.
from sqlalchemy import create_engine

#psql
import psycopg2

In [1161]:
print(pd.__version__)

2.3.3

In [1162]:
df = pd.read_csv(r"C:\Users\DELL\Desktop\wallmart\Walmart.csv")
df.shape

(10051, 11)

In [1163]:
df.head(5)

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,$74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,$15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48
2,3,WALM067,Haltom City,Home and lifestyle,$46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33
3,4,WALM064,Bedford,Health and beauty,$58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33
4,5,WALM013,Irving,Sports and travel,$86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48

In [1164]:
df.describe()

         invoice_id      quantity        rating  profit_margin
count  10051.000000  10020.000000  10051.000000   10051.000000
mean    5025.741220      2.353493      5.825659       0.393791
std     2901.174372      1.602658      1.763991       0.090669
min        1.000000      1.000000      3.000000       0.180000
25%     2513.500000      1.000000      4.000000       0.330000
50%     5026.000000      2.000000      6.000000       0.330000
75%     7538.500000      3.000000      7.000000       0.480000
max    10000.000000     10.000000     10.000000       0.570000

In [1165]:
df.duplicated().sum()

np.int64(51)

In [1166]:
df.drop_duplicates(inplace = True)
df.duplicated().sum()

np.int64(0)

In [1167]:
df.shape

(10000, 11)

In [1168]:
df.isnull().sum()

invoice_id         0
Branch             0
City               0
category           0
unit_price        31
quantity          31
date               0
time               0
payment_method     0
rating             0
profit_margin      0
dtype: int64

In [1169]:
# In quantity and unit_price both are missing, we do not know specifically how much has been purchased, hence it is better to remove the null values.
#Droping all rows with missing records.
df.dropna(inplace=True)

#Verify
df.shape
df.isnull().sum()

invoice_id        0
Branch            0
City              0
category          0
unit_price        0
quantity          0
date              0
time              0
payment_method    0
rating            0
profit_margin     0
dtype: int64

In [1170]:
#unit price needs to be changed.
df.dtypes #it shows that unit_price is an object.
df['unit_price'].astype(str)
df['unit_price'] = df['unit_price'].str.replace('$','')
df['unit_price'] = df['unit_price'].str.strip()
df['unit_price'] = df['unit_price'].astype(float)
df['unit_price']
df.head(5)
df.describe()

         invoice_id   unit_price     quantity       rating  profit_margin
count   9969.000000  9969.000000  9969.000000  9969.000000    9969.000000
mean    5010.116561    50.622142     2.355602     5.828839       0.393744
std     2886.217349    21.203766     1.605455     1.763723       0.090659
min        1.000000    10.080000     1.000000     3.000000       0.180000
25%     2524.000000    32.000000     1.000000     4.000000       0.330000
50%     5016.000000    51.000000     2.000000     6.000000       0.330000
75%     7508.000000    69.000000     3.000000     7.000000       0.480000
max    10000.000000    99.960000    10.000000    10.000000       0.570000

In [1171]:
df.columns = df.columns.str.lower()

df.columns

Index(['invoice_id', 'branch', 'city', 'category', 'unit_price', 'quantity',
       'date', 'time', 'payment_method', 'rating', 'profit_margin'],
      dtype='object')

In [1172]:
df['total'] = df['unit_price']*df['quantity']
df.head(5)

,invoice_id,branch,city,category,unit_price,quantity,date,time,payment_method,rating,profit_margin,total
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48,522.83
1,2,WALM048,Harlingen,Electronic accessories,15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48,76.40
2,3,WALM067,Haltom City,Home and lifestyle,46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33,324.31
3,4,WALM064,Bedford,Health and beauty,58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33,465.76
4,5,WALM013,Irving,Sports and travel,86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48,604.17

In [1173]:
df.shape

df.to_csv('walmart_clean.csv', index = False)

In [1174]:
#FOR MYSQL
# host = localhost
# port = 3306
# user = root
# password = 'your_password'

#FOR POSTGRESQL
# host = localhost
# port = 5432
# user = postgres
# password = 'your_password'

#** MYSQL CONNECTIONS **

# help(df.to_sql)

#engine = create_engine(
#        "mysql+mysqldb://scott:tiger@hostname/dbname",
#        pool_recycle=3600,
#        echo=True,
#    )

from sqlalchemy import create_engine

engine_mysql = create_engine(
    "mysql+pymysql://root:5090201%40Kd@localhost:3306/walmart_db"
)
try:
    engine_mysql
    print('Connected successfully.')
except:
    print('Unable to connect!')

# in password '@'= '%40'.

Connected successfully.

In [1175]:
df.to_sql(name = 'walmart', con=engine_mysql, if_exists='append', index=False)

9969